actividad_integradora/app/Controllers/usuario_Controller.php

        public function formValidation(){
            $input = $this->validate([
                'nombre' => 'required|min_length[3]',
                'apellido' => 'required|min_length[3]|max_length[25]',
                'usuario' => 'required|min_length[3]',
                'email' => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
                'pass' => 'required|min_length[3]|max_length[10]',
            ]);

            $fomrModel = new usuario_Model();

             if(!$input){
                $data['titulo'] = "Registro";
                echo view('front/head_view', $data);
                echo view('front/navbar_view');
                echo view('back/usuario/registrarse', ['validation' => $this->validator]);
                echo view('front/footer_view');
             }
             else{
                $fomrModel->save([
                    //field of Table into BD   ||     name of input into form
                    'nombre' => $this->request->getVar('nombre'),
                    'apellido' => $this->request->getVar('apellido'),
                    'usuario' => $this->request->getVar('usuario'),
                    'email' => $this->request->getVar('email'),
                    'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)
                ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('Amancio', 'Lopez', 'lopecito2000', 'lopezamancio@hotmail.com', '$2y$10$QX8Uhkvge5bgWHr9EOrSz.Dch5JE8QfnPeqxPsaHFis2DhTcUjFj.')